let myIdEle = document.getElementById("jav");
myIdEle.onclick = one;
function one() {
    alert("الوجهة السياحية رقم واحد في الصين يمتد من تشنهوانغتاو الى مقاطعة غانسو، لمسافة تقدر بنحو 6000 كم ارتفاعه يقدر من 6 الى 8 امتار يكفي لاستيعاب 10 رجال يضم العديد من ابراج المراقبة")
}
/*
   The Second
*/
let myIdEle1a = document.getElementById("jav1");
myIdEle1a.onclick = two;
function two() {
    alert("وجهة سياحية تقع في قلب مدينة بكين ، وهي تضم اكبر واهم مبنى في دولة الصين قصر الإمبراطوري ، والذي تم بنائه 1420 كمسكن للأمبراطور مينغ وتشينغ، تقدر مساحة هذا المجمع بنحو 72 الف متر مربع، يحيطها جدار يبلغ ارتفاعه حوالي 10 امتار مع مجموعة من ابراج المراقبة")
}
/*
   The Third
*/
let myIdEle2a = document.getElementById("jav2");
myIdEle2a.onclick = three;
function three() {
    alert("يقع على بغد 15 كم من مدينة بكين، وهو قصر يقع في وسط 700 فدان من الحدائق الجميلة، والتي تعد من اكثر النقاط جذبا للسياح في البلاد، القصر عبارة عن هيكل من ثلاثة طوابق تم بنائها في عام 1891، من قبل العائلة الحاكمة للصين")
}
/*
   The Fourth
*/
let myIdEle3a = document.getElementById("jav3");
myIdEle3a.onclick = four;
function four() {
    alert("يقدر طوله بحوالي 6000 كم، يعد اطول نهر في البلاد، وبكل تاكيد فانه احد ابرز المعالم السياحية للبلاد، والتي يقصدها السياح من اجل تجربة القيام برحلة بحرية في ثالث اطول نهر في العالم، بعد نهر النيل ونهر الامازون")
}
/*
   The Fifth
*/
let myIdEle4a = document.getElementById("jav4");
myIdEle4a.onclick = five;
function five() {
    alert("واحدة من افضل الحدائق التاريخية في العالم، واحد مواقع التراث العالمي لليونسكو في الصين، الحديقة تم انشائها في عام 1800 تقدر مساحتها بنحو 7 فدان، تضم الحديقة مجموعة من انواع النباتات، بالاضافة الى مسبح وعدد من المباني التاريخية ، وبستان من اشجار الفاكهة")
}
/*
   The sixth
*/
let myIdEle5a = document.getElementById("jav5");
myIdEle5a.onclick = six;
function six() {
    alert("تم بنائه كحصن ، ضل لقرون من الزمان مركزًا للقوة السياسية والدينية في الصين، اما اليوم فانه يعد من اكثر الوجهات جذبا للسياح في البلاد، وهنا يمكن للزائر الاستمتاع بالعديد من الاشياء، ومن اهمها اللوحات الجدارية التي تصور تاريخ المنطقة والقصر")
}
/*
    Japan
    The First
*/
let myIdEle1b = document.getElementById("jav6");
myIdEle1b.onclick = onee;
function onee() {
    alert("من المدن اليابانية الأكثر إكتظاظًا بالسكان في العالم. وهي العاصمة اليابانية، ومن الوجهات السياحية الهامة ، حيث تستقبل ملايين الزوار سنويًا من مختلف الأنحاء ، لإستكشاف معالمها الحضارية المتطورة والفريدة")
}
/*
    The Second
*/
let myIdEle2b = document.getElementById("jav7");
myIdEle2b.onclick = twoo;
function twoo() {
    alert("مدينة كيوتو تشتهر بأنها أجمل مدينة في العالم، فضلًا على أنها مدينة تاريخية ذات تراث ثقافي غني، وتتسم بالمظاهر الحضارية العديدة. فهي واحدة من أهم وأفضل وجهات السياحة في اليابان ، وتعتبر كيوتو العاصمة الثقافية والروحية لليابان, تتنوع الأنشطة الترفيهية التي يُمكنك القيام بها في كيوتو، ومنها إستكشاف معالمها التاريخية العظيمة ، حيث يوجد بها ما يزيد عن ألفي معبد ديني وضريح. كما يمكنك التجول في الأزقة المتعرجة المرصوفة، ومشاهدة المقاهي التقليدية ، والمطاعم على المستوى العالمي")
}
/*
    The Third
*/
let myIdEle3b = document.getElementById("jav8");
myIdEle3b.onclick = three;
function three() {
    alert("تقع مدينة كانازاوا على بحر اليابان، وهي مدينة جميلة تتسم بمناظرها الطبيعية الخلابة التي تسقطب كثيرا من الزوار للإسترخاء والإنسجام وسط أجواء المدينة الهادئة تضم كانازاوا العديد من المعالم السياحية والأثرية التي تتيح للسياح الإستمتاع بإستكشافها ، ومنها الأضرحة القديمة ، والمعابد والمتاحف الجميلة. فضلًا على التجول الممتع في الأحياء القديمة المحفوظة بشكل مذهل مثل الساموراي القديمة")
}
/*
    The Fourth
*/
let myIdEle4b = document.getElementById("jav9");
myIdEle4b.onclick = fourr;
function fourr() {
    alert("تتيح هيروشيما للسائح ممارسة جميع أنواع الأنشطة الترفيهية ، ومنها الإستمتاع بزيارة المعالم السياحية من المتاحف ، والمنتزهات والحدائق الترفيهية العديدة كمنتزه السلام التذكاري، ورؤية أطلال قبة غنباكو “قبة القنبلة النووية”، وضريح تسوكوشيما،  وقلعة هيروشيما، وكذلك الذهاب إلى الجزر القريبة من المدينة وأشهرها “جزيرة مياجيما”")
}
/*
    Germany
    The First
*/
let myIdEle1c = document.getElementById("jav10");
myIdEle1c.onclick = oone;
function oone() {
    alert("ثالث أكبر مدن المانيا وإحدى أجمل الاماكن السياحية في المانيا والعالم حيث يصفها البعض بقلب أوروبا النابض ففيها مختلف مناحي الحياة من ترفيه وتسوق وكذلك الطبيعة الخلابة وأجمل المشاهد الساحرة التي يمكن أن يراها السائح موقع ميونخ على نهر إيزار في جنوب بافاريا جعلها وجهة للكثير من السياح سنوياً كما انها تشتهر بالهندسة المعمارية الفريدة ووجود العديد من المعالم السياحية والمباني التاريخية فيها")
}
/*
    The Second
*/
let myIdEle2c = document.getElementById("jav11");
myIdEle2c.onclick = ttwo;
function ttwo() {
    alert("تعتبر مدينة بادن بادن من اجمل مدن المانيا السياحية فهي تحتضن الكثير من الأماكن السياحية الجميلة التي تجذب السياح عند عند قدومهم الى المانيا بادن بادن مفضلة عند السياح العرب ومن اهم معالم السياحة في المانيا بادن بادن، الحمامات الرومانية والأماكن الطبيعية كبحيرة موميلسي الرائعة والمنتزهات الجميلة")
}
/*
    The Third
*/
let myIdEle3c = document.getElementById("jav12");
myIdEle3c.onclick = tthre;
function tthre() {
    alert("مدينة دوسلدورف من اجمل وجهات السفر الى المانيا تعتبر المركز الاول للازياء والتسوق في المانيا حيث تشتهر بأسواقها وعروض الازياء العديدة التي تقام على ارضها يعتبر شارع الملوك من ابرز الاماكن السياحية في المانيا دوسلدورف ووجهة مميزة للتسوق حيث تتواجد فيه ارقى وافخم متاجر الازياء العالمية")
}